xml/Authorize.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://Ocpp/Cs/2012/06/">
    <x:Header>
        <ns:chargeBoxIdentity>{{.ChargeBoxID}}</ns:chargeBoxIdentity>
        <wsa5:To>{{.ServerURL}}</wsa5:To>
        <wsa5:From>
            <wsa5:Address>{{.OriginIP}}</wsa5:Address>
        </wsa5:From>
        <wsa5:Action>/Authorize</wsa5:Action>
    </x:Header>
    <x:Body>
        <ns:authorizeRequest>
            <ns:idTag>{{.AuthID}}</ns:idTag>
        </ns:authorizeRequest>
    </x:Body>
</x:Envelope>


<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn://Ocpp/Cs/2012/06/">
    <SOAP-ENV:Body>
        <ns1:authorizeResponse>
            <ns1:idTagInfo>
                <ns1:status>Accepted</ns1:status>
            </ns1:idTagInfo>
        </ns1:authorizeResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>